---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamSheetType
source: html/29736609-12ea-f5f3-5d1f-486536cf4aaa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamSheetType Property

"Fabric Sheet": List all Fabric Sheet types

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamSheetType { get; }
```